> [!CAUTION]
> If `storage_account_name` is replaced with `storage_account_id` the storage container will be _recreated_ ❗

```hcl
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.launchpad.azurerm_storage_container.this must be replaced
-/+ resource "azurerm_storage_container" "this" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://stlaunchpad.blob.core.windows.net/tfstate" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "tfstate"
      ~ resource_manager_id               = "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/RG/providers/Microsoft.Storage/storageAccounts/stlaunchpad/blobServices/default/containers/tfstate" -> (known after apply)
      + storage_account_id                = "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/RG/providers/Microsoft.Storage/storageAccounts/stlaunchpad" # forces replacement
      - storage_account_name              = "stlaunchpad" -> null # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```